zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxEbu_bf.h
/** \brief Offset for Ifx_EBU_SDRMCON_Bits.CRFSH */
#define IFX_EBU_SDRMCON_CRFSH_OFF (4u)

/** \brief Length for Ifx_EBU_SDRMCON_Bits.CRSC */
#define IFX_EBU_SDRMCON_CRSC_LEN (2u)

/** \brief Mask for Ifx_EBU_SDRMCON_Bits.CRSC */
#define IFX_EBU_SDRMCON_CRSC_MSK (0x3u)

/** \brief Offset for Ifx_EBU_SDRMCON_Bits.CRSC */
#define IFX_EBU_SDRMCON_CRSC_OFF (8u)

/** \brief Length for Ifx_EBU_SDRMCON_Bits.CRP */
#define IFX_EBU_SDRMCON_CRP_LEN (2u)

/** \brief Mask for Ifx_EBU_SDRMCON_Bits.CRP */
#define IFX_EBU_SDRMCON_CRP_MSK (0x3u)

/** \brief Offset for Ifx_EBU_SDRMCON_Bits.CRP */
#define IFX_EBU_SDRMCON_CRP_OFF (10u)

/** \brief Length for Ifx_EBU_SDRMCON_Bits.AWIDTH */
#define IFX_EBU_SDRMCON_AWIDTH_LEN (2u)

/** \brief Mask for Ifx_EBU_SDRMCON_Bits.AWIDTH */
#define IFX_EBU_SDRMCON_AWIDTH_MSK (0x3u)

/** \brief Offset for Ifx_EBU_SDRMCON_Bits.AWIDTH */
#define IFX_EBU_SDRMCON_AWIDTH_OFF (12u)

/** \brief Length for Ifx_EBU_SDRMCON_Bits.CRCD */
#define IFX_EBU_SDRMCON_CRCD_LEN (2u)

/** \brief Mask for Ifx_EBU_SDRMCON_Bits.CRCD */
#define IFX_EBU_SDRMCON_CRCD_MSK (0x3u)

/** \brief Offset for Ifx_EBU_SDRMCON_Bits.CRCD */
#define IFX_EBU_SDRMCON_CRCD_OFF (14u)

/** \brief Length for Ifx_EBU_SDRMCON_Bits.CRC */
#define IFX_EBU_SDRMCON_CRC_LEN (6u)

/** \brief Mask for Ifx_EBU_SDRMCON_Bits.CRC */
#define IFX_EBU_SDRMCON_CRC_MSK (0x3fu)

/** \brief Offset for Ifx_EBU_SDRMCON_Bits.CRC */
#define IFX_EBU_SDRMCON_CRC_OFF (16u)

/** \brief Length for Ifx_EBU_SDRMCON_Bits.BANKM */
#define IFX_EBU_SDRMCON_BANKM_LEN (3u)

/** \brief Mask for Ifx_EBU_SDRMCON_Bits.BANKM */
#define IFX_EBU_SDRMCON_BANKM_MSK (0x7u)

/** \brief Offset for Ifx_EBU_SDRMCON_Bits.BANKM */
#define IFX_EBU_SDRMCON_BANKM_OFF (22u)

/** \brief Length for Ifx_EBU_SDRMCON_Bits.CLKDIS */
#define IFX_EBU_SDRMCON_CLKDIS_LEN (1u)

/** \brief Mask for Ifx_EBU_SDRMCON_Bits.CLKDIS */
#define IFX_EBU_SDRMCON_CLKDIS_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDRMCON_Bits.CLKDIS */
#define IFX_EBU_SDRMCON_CLKDIS_OFF (28u)

/** \brief Length for Ifx_EBU_SDRMCON_Bits.PWR_MODE */
#define IFX_EBU_SDRMCON_PWR_MODE_LEN (2u)

/** \brief Mask for Ifx_EBU_SDRMCON_Bits.PWR_MODE */
#define IFX_EBU_SDRMCON_PWR_MODE_MSK (0x3u)

/** \brief Offset for Ifx_EBU_SDRMCON_Bits.PWR_MODE */
#define IFX_EBU_SDRMCON_PWR_MODE_OFF (29u)

/** \brief Length for Ifx_EBU_SDRMCON_Bits.SDCMSEL */
#define IFX_EBU_SDRMCON_SDCMSEL_LEN (1u)

/** \brief Mask for Ifx_EBU_SDRMCON_Bits.SDCMSEL */
#define IFX_EBU_SDRMCON_SDCMSEL_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDRMCON_Bits.SDCMSEL */
#define IFX_EBU_SDRMCON_SDCMSEL_OFF (31u)

/** \brief Length for Ifx_EBU_SDRMOD_Bits.BURSTL */
#define IFX_EBU_SDRMOD_BURSTL_LEN (3u)

/** \brief Mask for Ifx_EBU_SDRMOD_Bits.BURSTL */
#define IFX_EBU_SDRMOD_BURSTL_MSK (0x7u)

/** \brief Offset for Ifx_EBU_SDRMOD_Bits.BURSTL */
#define IFX_EBU_SDRMOD_BURSTL_OFF (0u)

/** \brief Length for Ifx_EBU_SDRMOD_Bits.BTYP */
#define IFX_EBU_SDRMOD_BTYP_LEN (1u)

/** \brief Mask for Ifx_EBU_SDRMOD_Bits.BTYP */
#define IFX_EBU_SDRMOD_BTYP_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDRMOD_Bits.BTYP */
#define IFX_EBU_SDRMOD_BTYP_OFF (3u)

/** \brief Length for Ifx_EBU_SDRMOD_Bits.CASLAT */
#define IFX_EBU_SDRMOD_CASLAT_LEN (3u)

/** \brief Mask for Ifx_EBU_SDRMOD_Bits.CASLAT */
#define IFX_EBU_SDRMOD_CASLAT_MSK (0x7u)

/** \brief Offset for Ifx_EBU_SDRMOD_Bits.CASLAT */
#define IFX_EBU_SDRMOD_CASLAT_OFF (4u)

/** \brief Length for Ifx_EBU_SDRMOD_Bits.OPMODE */
#define IFX_EBU_SDRMOD_OPMODE_LEN (7u)

/** \brief Mask for Ifx_EBU_SDRMOD_Bits.OPMODE */
#define IFX_EBU_SDRMOD_OPMODE_MSK (0x7fu)

/** \brief Offset for Ifx_EBU_SDRMOD_Bits.OPMODE */
#define IFX_EBU_SDRMOD_OPMODE_OFF (7u)

/** \brief Length for Ifx_EBU_SDRMOD_Bits.COLDSTART */
#define IFX_EBU_SDRMOD_COLDSTART_LEN (1u)

/** \brief Mask for Ifx_EBU_SDRMOD_Bits.COLDSTART */
#define IFX_EBU_SDRMOD_COLDSTART_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDRMOD_Bits.COLDSTART */
#define IFX_EBU_SDRMOD_COLDSTART_OFF (15u)

/** \brief Length for Ifx_EBU_SDRMOD_Bits.XOPM */
#define IFX_EBU_SDRMOD_XOPM_LEN (14u)

/** \brief Mask for Ifx_EBU_SDRMOD_Bits.XOPM */
#define IFX_EBU_SDRMOD_XOPM_MSK (0x3fffu)

/** \brief Offset for Ifx_EBU_SDRMOD_Bits.XOPM */
#define IFX_EBU_SDRMOD_XOPM_OFF (16u)

/** \brief Length for Ifx_EBU_SDRMOD_Bits.XBA */
#define IFX_EBU_SDRMOD_XBA_LEN (2u)

/** \brief Mask for Ifx_EBU_SDRMOD_Bits.XBA */
#define IFX_EBU_SDRMOD_XBA_MSK (0x3u)

/** \brief Offset for Ifx_EBU_SDRMOD_Bits.XBA */
#define IFX_EBU_SDRMOD_XBA_OFF (30u)

/** \brief Length for Ifx_EBU_SDRMREF_Bits.REFRESHC */
#define IFX_EBU_SDRMREF_REFRESHC_LEN (6u)

/** \brief Mask for Ifx_EBU_SDRMREF_Bits.REFRESHC */
#define IFX_EBU_SDRMREF_REFRESHC_MSK (0x3fu)

/** \brief Offset for Ifx_EBU_SDRMREF_Bits.REFRESHC */
#define IFX_EBU_SDRMREF_REFRESHC_OFF (0u)

/** \brief Length for Ifx_EBU_SDRMREF_Bits.REFRESHR */
#define IFX_EBU_SDRMREF_REFRESHR_LEN (3u)

/** \brief Mask for Ifx_EBU_SDRMREF_Bits.REFRESHR */
#define IFX_EBU_SDRMREF_REFRESHR_MSK (0x7u)

/** \brief Offset for Ifx_EBU_SDRMREF_Bits.REFRESHR */
#define IFX_EBU_SDRMREF_REFRESHR_OFF (6u)

/** \brief Length for Ifx_EBU_SDRMREF_Bits.SELFREXST */
#define IFX_EBU_SDRMREF_SELFREXST_LEN (1u)

/** \brief Mask for Ifx_EBU_SDRMREF_Bits.SELFREXST */
#define IFX_EBU_SDRMREF_SELFREXST_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDRMREF_Bits.SELFREXST */
#define IFX_EBU_SDRMREF_SELFREXST_OFF (9u)

/** \brief Length for Ifx_EBU_SDRMREF_Bits.SELFREX */
#define IFX_EBU_SDRMREF_SELFREX_LEN (1u)

/** \brief Mask for Ifx_EBU_SDRMREF_Bits.SELFREX */
#define IFX_EBU_SDRMREF_SELFREX_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDRMREF_Bits.SELFREX */
#define IFX_EBU_SDRMREF_SELFREX_OFF (10u)

/** \brief Length for Ifx_EBU_SDRMREF_Bits.SELFRENST */
#define IFX_EBU_SDRMREF_SELFRENST_LEN (1u)

/** \brief Mask for Ifx_EBU_SDRMREF_Bits.SELFRENST */
#define IFX_EBU_SDRMREF_SELFRENST_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDRMREF_Bits.SELFRENST */
#define IFX_EBU_SDRMREF_SELFRENST_OFF (11u)

/** \brief Length for Ifx_EBU_SDRMREF_Bits.SELFREN */
#define IFX_EBU_SDRMREF_SELFREN_LEN (1u)

