zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxEbu_bf.h
/** \brief Mask for Ifx_EBU_SDRMREF_Bits.SELFREN */
#define IFX_EBU_SDRMREF_SELFREN_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDRMREF_Bits.SELFREN */
#define IFX_EBU_SDRMREF_SELFREN_OFF (12u)

/** \brief Length for Ifx_EBU_SDRMREF_Bits.AUTOSELFR */
#define IFX_EBU_SDRMREF_AUTOSELFR_LEN (1u)

/** \brief Mask for Ifx_EBU_SDRMREF_Bits.AUTOSELFR */
#define IFX_EBU_SDRMREF_AUTOSELFR_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDRMREF_Bits.AUTOSELFR */
#define IFX_EBU_SDRMREF_AUTOSELFR_OFF (13u)

/** \brief Length for Ifx_EBU_SDRMREF_Bits.ERFSHC */
#define IFX_EBU_SDRMREF_ERFSHC_LEN (2u)

/** \brief Mask for Ifx_EBU_SDRMREF_Bits.ERFSHC */
#define IFX_EBU_SDRMREF_ERFSHC_MSK (0x3u)

/** \brief Offset for Ifx_EBU_SDRMREF_Bits.ERFSHC */
#define IFX_EBU_SDRMREF_ERFSHC_OFF (14u)

/** \brief Length for Ifx_EBU_SDRMREF_Bits.SELFREX_DLY */
#define IFX_EBU_SDRMREF_SELFREX_DLY_LEN (8u)

/** \brief Mask for Ifx_EBU_SDRMREF_Bits.SELFREX_DLY */
#define IFX_EBU_SDRMREF_SELFREX_DLY_MSK (0xffu)

/** \brief Offset for Ifx_EBU_SDRMREF_Bits.SELFREX_DLY */
#define IFX_EBU_SDRMREF_SELFREX_DLY_OFF (16u)

/** \brief Length for Ifx_EBU_SDRMREF_Bits.ARFSH */
#define IFX_EBU_SDRMREF_ARFSH_LEN (1u)

/** \brief Mask for Ifx_EBU_SDRMREF_Bits.ARFSH */
#define IFX_EBU_SDRMREF_ARFSH_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDRMREF_Bits.ARFSH */
#define IFX_EBU_SDRMREF_ARFSH_OFF (24u)

/** \brief Length for Ifx_EBU_SDRMREF_Bits.RES_DLY */
#define IFX_EBU_SDRMREF_RES_DLY_LEN (3u)

/** \brief Mask for Ifx_EBU_SDRMREF_Bits.RES_DLY */
#define IFX_EBU_SDRMREF_RES_DLY_MSK (0x7u)

/** \brief Offset for Ifx_EBU_SDRMREF_Bits.RES_DLY */
#define IFX_EBU_SDRMREF_RES_DLY_OFF (25u)

/** \brief Length for Ifx_EBU_SDRSTAT_Bits.REFERR */
#define IFX_EBU_SDRSTAT_REFERR_LEN (1u)

/** \brief Mask for Ifx_EBU_SDRSTAT_Bits.REFERR */
#define IFX_EBU_SDRSTAT_REFERR_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDRSTAT_Bits.REFERR */
#define IFX_EBU_SDRSTAT_REFERR_OFF (0u)

/** \brief Length for Ifx_EBU_SDRSTAT_Bits.SDRMBUSY */
#define IFX_EBU_SDRSTAT_SDRMBUSY_LEN (1u)

/** \brief Mask for Ifx_EBU_SDRSTAT_Bits.SDRMBUSY */
#define IFX_EBU_SDRSTAT_SDRMBUSY_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDRSTAT_Bits.SDRMBUSY */
#define IFX_EBU_SDRSTAT_SDRMBUSY_OFF (1u)

/** \brief Length for Ifx_EBU_SDRSTAT_Bits.SDERR */
#define IFX_EBU_SDRSTAT_SDERR_LEN (1u)

/** \brief Mask for Ifx_EBU_SDRSTAT_Bits.SDERR */
#define IFX_EBU_SDRSTAT_SDERR_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDRSTAT_Bits.SDERR */
#define IFX_EBU_SDRSTAT_SDERR_OFF (2u)

/** \brief Length for Ifx_EBU_ACCEN0_Bits.EN0 */
#define IFX_EBU_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_EBU_ACCEN0_Bits.EN0 */
#define IFX_EBU_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ACCEN0_Bits.EN0 */
#define IFX_EBU_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_EBU_ACCEN0_Bits.EN1 */
#define IFX_EBU_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_EBU_ACCEN0_Bits.EN1 */
#define IFX_EBU_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ACCEN0_Bits.EN1 */
#define IFX_EBU_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_EBU_ACCEN0_Bits.EN2 */
#define IFX_EBU_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_EBU_ACCEN0_Bits.EN2 */
#define IFX_EBU_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ACCEN0_Bits.EN2 */
#define IFX_EBU_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_EBU_ACCEN0_Bits.EN3 */
#define IFX_EBU_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_EBU_ACCEN0_Bits.EN3 */
#define IFX_EBU_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ACCEN0_Bits.EN3 */
#define IFX_EBU_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_EBU_ACCEN0_Bits.EN4 */
#define IFX_EBU_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_EBU_ACCEN0_Bits.EN4 */
#define IFX_EBU_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ACCEN0_Bits.EN4 */
#define IFX_EBU_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_EBU_ACCEN0_Bits.EN5 */
#define IFX_EBU_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_EBU_ACCEN0_Bits.EN5 */
#define IFX_EBU_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ACCEN0_Bits.EN5 */
#define IFX_EBU_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_EBU_ACCEN0_Bits.EN6 */
#define IFX_EBU_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_EBU_ACCEN0_Bits.EN6 */
#define IFX_EBU_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ACCEN0_Bits.EN6 */
#define IFX_EBU_ACCEN0_EN6_OFF (6u)

/** \brief Length for Ifx_EBU_ACCEN0_Bits.EN7 */
#define IFX_EBU_ACCEN0_EN7_LEN (1u)

/** \brief Mask for Ifx_EBU_ACCEN0_Bits.EN7 */
#define IFX_EBU_ACCEN0_EN7_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ACCEN0_Bits.EN7 */
#define IFX_EBU_ACCEN0_EN7_OFF (7u)

/** \brief Length for Ifx_EBU_ACCEN0_Bits.EN8 */
#define IFX_EBU_ACCEN0_EN8_LEN (1u)

/** \brief Mask for Ifx_EBU_ACCEN0_Bits.EN8 */
#define IFX_EBU_ACCEN0_EN8_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ACCEN0_Bits.EN8 */
#define IFX_EBU_ACCEN0_EN8_OFF (8u)

/** \brief Length for Ifx_EBU_ACCEN0_Bits.EN9 */
#define IFX_EBU_ACCEN0_EN9_LEN (1u)

/** \brief Mask for Ifx_EBU_ACCEN0_Bits.EN9 */
#define IFX_EBU_ACCEN0_EN9_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ACCEN0_Bits.EN9 */
#define IFX_EBU_ACCEN0_EN9_OFF (9u)

/** \brief Length for Ifx_EBU_ACCEN0_Bits.EN10 */
#define IFX_EBU_ACCEN0_EN10_LEN (1u)

/** \brief Mask for Ifx_EBU_ACCEN0_Bits.EN10 */
#define IFX_EBU_ACCEN0_EN10_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ACCEN0_Bits.EN10 */
#define IFX_EBU_ACCEN0_EN10_OFF (10u)

/** \brief Length for Ifx_EBU_ACCEN0_Bits.EN11 */
#define IFX_EBU_ACCEN0_EN11_LEN (1u)

/** \brief Mask for Ifx_EBU_ACCEN0_Bits.EN11 */
#define IFX_EBU_ACCEN0_EN11_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ACCEN0_Bits.EN11 */
#define IFX_EBU_ACCEN0_EN11_OFF (11u)

/** \brief Length for Ifx_EBU_ACCEN0_Bits.EN12 */
#define IFX_EBU_ACCEN0_EN12_LEN (1u)

/** \brief Mask for Ifx_EBU_ACCEN0_Bits.EN12 */
#define IFX_EBU_ACCEN0_EN12_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ACCEN0_Bits.EN12 */
#define IFX_EBU_ACCEN0_EN12_OFF (12u)

/** \brief Length for Ifx_EBU_ACCEN0_Bits.EN13 */
#define IFX_EBU_ACCEN0_EN13_LEN (1u)

/** \brief Mask for Ifx_EBU_ACCEN0_Bits.EN13 */
#define IFX_EBU_ACCEN0_EN13_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ACCEN0_Bits.EN13 */
#define IFX_EBU_ACCEN0_EN13_OFF (13u)

/** \brief Length for Ifx_EBU_ACCEN0_Bits.EN14 */
#define IFX_EBU_ACCEN0_EN14_LEN (1u)

